#### TableMergedCell Members

---

|  |
| --- |
| TableMergedCell Class   Constructors   Methods   Properties   See Also |

The  TableMergedCell  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | TableMergedCell | Default constructor. |
| Public method | TableMergedCell(Int32, Int32, Int32, Int32) | Constructor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  TableMergedCell |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Bottom | Specifies the row index of the bottom-right corner of a table grid. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Left | Specifies the column index of the top-left corner of a table grid. |
| Public property | Right | Specifies the column index of the bottom-right corner of a table grid. |
| Public property | Top | Specifies the row index of the top-left corner of a table grid. |

# See Also

TableMergedCell Class

Autodesk.Revit.DB Namespace